#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/demo-kk/gh-actions-demo/runs/run-VwuCUQPUnPniR6Ra

Waiting for the plan to start...

Terraform v1.7.3
on linux_amd64
Initializing plugins and modules...
data.terraform_remote_state.eks: Refreshing...
random_string.suffix: Refreshing state... [id=ZKZR2wYG]
module.eks.module.eks_managed_node_group["one"].data.aws_caller_identity.current: Refreshing...
data.aws_availability_zones.available: Refreshing...
data.aws_iam_policy.ebs_csi_policy: Refreshing...
module.irsa-ebs-csi.data.aws_caller_identity.current: Refreshing...
module.irsa-ebs-csi.data.aws_partition.current: Refreshing...
module.eks.module.eks_managed_node_group["two"].data.aws_caller_identity.current: Refreshing...
module.eks.data.aws_caller_identity.current: Refreshing...
module.eks.module.kms.data.aws_partition.current: Refreshing...
module.eks.data.aws_partition.current: Refreshing...
module.irsa-ebs-csi.data.aws_partition.current: Refresh complete after 0s [id=aws]
module.eks.data.aws_partition.current: Refresh complete after 0s [id=aws]
module.eks.module.kms.data.aws_partition.current: Refresh complete after 0s [id=aws]
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/guru-eks-ZKZR2wYG/cluster]
module.eks.module.eks_managed_node_group["one"].data.aws_partition.current: Refreshing...
module.eks.module.eks_managed_node_group["two"].data.aws_partition.current: Refreshing...
module.eks.module.eks_managed_node_group["one"].data.aws_partition.current: Refresh complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["two"].data.aws_partition.current: Refresh complete after 0s [id=aws]
module.eks.module.kms.data.aws_caller_identity.current: Refreshing...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-079df9a103e66185e]
module.eks.module.eks_managed_node_group["one"].data.aws_caller_identity.current: Refresh complete after 0s [id=763885061949]
module.eks.module.eks_managed_node_group["two"].data.aws_caller_identity.current: Refresh complete after 0s [id=763885061949]
module.irsa-ebs-csi.data.aws_caller_identity.current: Refresh complete after 0s [id=763885061949]
module.eks.data.aws_caller_identity.current: Refresh complete after 0s [id=763885061949]
module.eks.module.eks_managed_node_group["one"].data.aws_iam_policy_document.assume_role_policy[0]: Refreshing...
module.eks.data.aws_iam_session_context.current: Refreshing...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Refreshing...
module.eks.module.eks_managed_node_group["two"].data.aws_iam_policy_document.assume_role_policy[0]: Refreshing...
module.eks.module.kms.data.aws_caller_identity.current: Refresh complete after 0s [id=763885061949]
module.eks.module.eks_managed_node_group["one"].data.aws_iam_policy_document.assume_role_policy[0]: Refresh complete after 0s [id=2560088296]
module.eks.data.aws_iam_session_context.current: Refresh complete after 0s [id=arn:aws:iam::763885061949:user/terraform]
module.eks.module.eks_managed_node_group["two"].data.aws_iam_policy_document.assume_role_policy[0]: Refresh complete after 0s [id=2560088296]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Refresh complete after 0s [id=2764486067]
module.eks.module.eks_managed_node_group["one"].aws_iam_role.this[0]: Refreshing state... [id=node-group-1-eks-node-group-20240221144824330800000002]
module.eks.module.eks_managed_node_group["two"].aws_iam_role.this[0]: Refreshing state... [id=node-group-2-eks-node-group-20240221144824328600000001]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=guru-eks-ZKZR2wYG-cluster-20240221144824332900000003]
data.aws_availability_zones.available: Refresh complete after 0s [id=us-east-1]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-07455e2906659382f]
data.aws_iam_policy.ebs_csi_policy: Refresh complete after 0s [id=arn:aws:iam::aws:policy/service-role/AmazonEBSCSIDriverPolicy]
data.terraform_remote_state.eks: Refresh complete after 1s
data.aws_eks_cluster.cluster: Refreshing...
data.aws_eks_cluster.cluster: Refresh complete after 0s [id=guru-eks-ZKZR2wYG]
module.eks.module.eks_managed_node_group["one"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=node-group-1-eks-node-group-20240221144824330800000002-20240221144825189700000006]
module.eks.module.eks_managed_node_group["two"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=node-group-2-eks-node-group-20240221144824328600000001-2024022114482534630000000b]
module.eks.module.eks_managed_node_group["two"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=node-group-2-eks-node-group-20240221144824328600000001-20240221144825136800000005]
module.eks.module.eks_managed_node_group["one"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=node-group-1-eks-node-group-20240221144824330800000002-20240221144825190000000007]
module.eks.module.eks_managed_node_group["two"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=node-group-2-eks-node-group-20240221144824328600000001-20240221144825135300000004]
module.eks.module.eks_managed_node_group["one"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=node-group-1-eks-node-group-20240221144824330800000002-20240221144825224700000008]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=guru-eks-ZKZR2wYG-cluster-20240221144824332900000003-20240221144825245200000009]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=guru-eks-ZKZR2wYG-cluster-20240221144824332900000003-2024022114482526530000000a]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Refreshing...
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Refresh complete after 0s [id=1053069491]
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=0a724240-ffe9-4ded-840b-ae6456b16f30]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-06d50024d0da9d6e4]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0b8eb2827f6cd0a9c]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0db64824800ef73ac]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-05c562fea9cad56a3]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-009d3b7d46b4d191c]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-06f3ff40196b81db2]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0da188a6c2ef6b0d7]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-00a30f3970304590c]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-001c1f8dc0f209fa8]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-02b9550d39fa03ff2]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0043c72c2176a2c4e]
module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/guru-eks-ZKZR2wYG]
module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::763885061949:policy/guru-eks-ZKZR2wYG-cluster-ClusterEncryption2024022114485002780000000f]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-001c1f8dc0f209fa81080289494]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-049f2bbbe70333ab5]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-07b77304f7367cc38]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0d174a73704a8917b]
module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-3509196613]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-2708089944]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-4053267755]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-329134796]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-3346018344]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-3082916131]
module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-1872068409]
module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-3914881084]
module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-3045794958]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-226878143]
module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=guru-eks-ZKZR2wYG-cluster-20240221144824332900000003-20240221144850455000000010]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0d0d18355502025bf]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-03b0ba25516b21b06]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-08c5c2ba22550ae5d]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-056a2c485b00eec1b]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-06f3ff40196b81db21080289494]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=guru-eks-ZKZR2wYG]
module.irsa-ebs-csi.data.aws_iam_policy_document.assume_role_with_oidc[0]: Refreshing...
module.eks.data.tls_certificate.this[0]: Refreshing...
module.irsa-ebs-csi.data.aws_iam_policy_document.assume_role_with_oidc[0]: Refresh complete after 0s [id=3045155953]
module.irsa-ebs-csi.aws_iam_role.this[0]: Refreshing state... [id=AmazonEKSTFEBSCSIRole-guru-eks-ZKZR2wYG]
module.eks.module.eks_managed_node_group["one"].aws_launch_template.this[0]: Refreshing state... [id=lt-0024e553b2f98d045]
module.eks.module.eks_managed_node_group["two"].aws_launch_template.this[0]: Refreshing state... [id=lt-09041b597a2acfc3b]
module.eks.data.tls_certificate.this[0]: Refresh complete after 0s [id=5933588ce34e24e9fb40c3565fb0b5993639df67]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::763885061949:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/1722E9939D8E453F0D02FC1C59C4CE60]
module.eks.module.eks_managed_node_group["two"].aws_eks_node_group.this[0]: Refreshing state... [id=guru-eks-ZKZR2wYG:node-group-2-20240221145805417200000015]
module.eks.module.eks_managed_node_group["one"].aws_eks_node_group.this[0]: Refreshing state... [id=guru-eks-ZKZR2wYG:node-group-1-20240221145805418100000017]
module.irsa-ebs-csi.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=AmazonEKSTFEBSCSIRole-guru-eks-ZKZR2wYG-2024022114580578930000001a]
aws_eks_addon.ebs-csi: Refreshing state... [id=guru-eks-ZKZR2wYG:aws-ebs-csi-driver]
module.eks.module.eks_managed_node_group["one"].aws_eks_node_group.this[0]: Drift detected (update)
module.eks.module.eks_managed_node_group["one"].aws_iam_role.this[0]: Drift detected (update)
module.eks.module.eks_managed_node_group["one"].aws_launch_template.this[0]: Drift detected (update)
module.eks.module.eks_managed_node_group["two"].aws_eks_node_group.this[0]: Drift detected (update)
module.eks.module.eks_managed_node_group["two"].aws_iam_role.this[0]: Drift detected (update)
module.eks.module.eks_managed_node_group["two"].aws_launch_template.this[0]: Drift detected (update)
module.eks.module.kms.aws_kms_key.this[0]: Drift detected (update)
module.irsa-ebs-csi.aws_iam_role.this[0]: Drift detected (update)
module.vpc.aws_eip.nat[0]: Drift detected (update)
module.vpc.aws_route_table.private[0]: Drift detected (update)
module.vpc.aws_route_table.public[0]: Drift detected (update)
module.eks.aws_security_group.node[0]: Drift detected (update)
module.eks.aws_eks_cluster.this[0]: Drift detected (update)
module.eks.aws_security_group.cluster[0]: Drift detected (update)
module.eks.aws_iam_role.this[0]: Drift detected (update)
module.eks.aws_cloudwatch_log_group.this[0]: Drift detected (update)
module.eks.aws_iam_policy.cluster_encryption[0]: Drift detected (update)
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "AWS_SECRET_ACCESS_KEY"
│ but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-VwuCUQPUnPniR6Ra/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "AWS_ACCESS_KEY_ID" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-VwuCUQPUnPniR6Ra/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.eks.module.eks_managed_node_group["one"].aws_eks_node_group.this[0] has changed
  ~ resource "aws_eks_node_group" "this" {
        id                     = "guru-eks-ZKZR2wYG:node-group-1-20240221145805418100000017"
      + labels                 = {}
        tags                   = {
            "Name" = "node-group-1"
        }
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.eks.module.eks_managed_node_group["two"].aws_eks_node_group.this[0] has changed
  ~ resource "aws_eks_node_group" "this" {
        id                     = "guru-eks-ZKZR2wYG:node-group-2-20240221145805417200000015"
      + labels                 = {}
        tags                   = {
            "Name" = "node-group-2"
        }
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # kubernetes_deployment.nginx will be created
  + resource "kubernetes_deployment" "nginx" {
      + id               = (known after apply)
      + wait_for_rollout = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "App" = "LongLiveTheBat"
            }
          + name             = "long-live-the-bat"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + min_ready_seconds         = 0
          + paused                    = false
          + progress_deadline_seconds = 600
          + replicas                  = "2"
          + revision_history_limit    = 10

          + selector {
              + match_labels = {
                  + "App" = "LongLiveTheBat"
                }
            }

          + template {
              + metadata {
                  + generation       = (known after apply)
                  + labels           = {
                      + "App" = "LongLiveTheBat"
                    }
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                }
              + spec {
                  + automount_service_account_token  = true
                  + dns_policy                       = "ClusterFirst"
                  + enable_service_links             = true
                  + host_ipc                         = false
                  + host_network                     = false
                  + host_pid                         = false
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  + restart_policy                   = "Always"
                  + scheduler_name                   = (known after apply)
                  + service_account_name             = (known after apply)
                  + share_process_namespace          = false
                  + termination_grace_period_seconds = 30

                  + container {
                      + image                      = "nginx:1.7.8"
                      + image_pull_policy          = (known after apply)
                      + name                       = "batman"
                      + stdin                      = false
                      + stdin_once                 = false
                      + termination_message_path   = "/dev/termination-log"
                      + termination_message_policy = (known after apply)
                      + tty                        = false

                      + port {
                          + container_port = 80
                          + protocol       = "TCP"
                        }

                      + resources {
                          + limits   = {
                              + "cpu"    = "0.5"
                              + "memory" = "512Mi"
                            }
                          + requests = {
                              + "cpu"    = "250m"
                              + "memory" = "50Mi"
                            }
                        }
                    }
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @karthikgru, Action: `pull_request`*